; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_2 ?v8 - type_1 ?v5 - type_2)
 	      (pred_4 ?v2 - object ?v5 - type_2)
	      (pred_3 ?v8 - type_1 ?v4 - type_3)
	      (pred_1 ?v8 - type_1 ?v2 - object ?v4 - type_3))

   (:action op_1
       :parameters  (?v8 - type_1 ?v6 ?v7 - type_2)
       :precondition (and  (pred_2 ?v8 ?v6))
       :effect (and  (pred_2 ?v8 ?v7)
		     (not (pred_2 ?v8 ?v6))))

   (:action op_2
       :parameters (?v8 - type_1 ?v3 - object ?v1 - type_2 ?v4 - type_3)
       :precondition  (and  (pred_4 ?v3 ?v1) (pred_2 ?v8 ?v1) (pred_3 ?v8 ?v4))
       :effect (and (pred_1 ?v8 ?v3 ?v4)
		    (not (pred_4 ?v3 ?v1)) 
		    (not (pred_3 ?v8 ?v4))))

   (:action op_3
       :parameters (?v8 - type_1 ?v3 - object ?v1 - type_2 ?v4 - type_3)
       :precondition  (and  (pred_1 ?v8 ?v3 ?v4) (pred_2 ?v8 ?v1))
       :effect (and (pred_4 ?v3 ?v1)
		    (pred_3 ?v8 ?v4)
		    (not (pred_1 ?v8 ?v3 ?v4)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_04 obj_12 - type_1
obj_11 obj_10 obj_06 obj_09 - type_3
obj_01 obj_02 obj_07 - type_2
obj_05 obj_03 obj_08 - object)
(:init
(pred_2 obj_04 obj_07)
(pred_3 obj_04 obj_11)
(pred_3 obj_04 obj_10)
(pred_2 obj_12 obj_07)
(pred_3 obj_12 obj_06)
(pred_3 obj_12 obj_09)
(pred_4 obj_05 obj_01)
(pred_4 obj_03 obj_07)
(pred_4 obj_08 obj_02)
)
(:goal
(and
(pred_4 obj_05 obj_01)
(pred_4 obj_03 obj_02)
(pred_4 obj_08 obj_07)
)
)

(:constraints
  (always (not (pred_2 obj_04 obj_02)))
)
)

; plan
1. (op_2 obj_04 obj_03 obj_07 obj_10)
   deleted: (pred_4 obj_03 obj_07) (pred_3 obj_04 obj_10)
   added: (pred_1 obj_04 obj_03 obj_10)
   goals met: 1 of 3
2. (op_1 obj_12 obj_07 obj_02)
   deleted: (pred_2 obj_12 obj_07)
   added: (pred_2 obj_12 obj_02)
   goals met: 1 of 3
3. (op_2 obj_12 obj_08 obj_02 obj_09)
   deleted: (pred_4 obj_08 obj_02) (pred_3 obj_12 obj_09)
   added: (pred_1 obj_12 obj_08 obj_09)
   goals met: 1 of 3
4. (op_1 obj_12 obj_02 obj_07)
   deleted: (pred_2 obj_12 obj_02)
   added: (pred_2 obj_12 obj_07)
   goals met: 1 of 3
5. (op_3 obj_12 obj_08 obj_07 obj_09)
   deleted: (pred_1 obj_12 obj_08 obj_09)
   added: (pred_4 obj_08 obj_07) (pred_3 obj_12 obj_09)
   goals met: 2 of 3
6. (op_3 obj_04 obj_03 obj_07 obj_10)
   deleted: (pred_1 obj_04 obj_03 obj_10)
   added: (pred_4 obj_03 obj_07) (pred_3 obj_04 obj_10)
   goals met: 2 of 3
7. (op_2 obj_12 obj_03 obj_07 obj_09)
   deleted: (pred_4 obj_03 obj_07) (pred_3 obj_12 obj_09)
   added: (pred_1 obj_12 obj_03 obj_09)
   goals met: 2 of 3
8. (op_1 obj_12 obj_07 obj_02)
   deleted: (pred_2 obj_12 obj_07)
   added: (pred_2 obj_12 obj_02)
   goals met: 2 of 3
9. (op_3 obj_12 obj_03 obj_02 obj_09)
   deleted: (pred_1 obj_12 obj_03 obj_09)
   added: (pred_4 obj_03 obj_02) (pred_3 obj_12 obj_09)
   goals met: 3 of 3
